quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'В каком году написана первая статья про Python',
        'options': ['1999', '1714', '1980', '2000'],
        'correct_option': 2
    },
    {
        'question': 'Кто создатель языка программирования Python?',
        'options': ['Гнида Опосум', 'Сильно Заросший', 'Голландец', 'Гвидо Ван Россум'],
        'correct_option': 3
    },
    {
        'question': 'Что такое PEP 8?',
        'options': ['Лягушка Пепе?', '8 лягушек?', 'Документ рекомендация по написанию кода', 'Модуль Python'],
        'correct_option': 2
    },
    {
        'question': 'Что такое tuple?',
        'options': ['Кортеж', 'Список', 'Строка', 'Тупой?'],
        'correct_option': 0
    },
    {
        'question': 'Что хранится в атрибуте dict?',
        'options': ["{'name': 'Alice', 'age': 25}", "[8, 8, 8, 8]", '(memchiki)', '0'],
        'correct_option': 0
    },
    {
        'question': 'Обязательно ли в Пайтоне объявлять тип переменной?',
        'options': ['по желанию программиста', 'обязательно', 'зависит от ситуации', 'объявлять тип не нужно'],
        'correct_option': 0
    },
    {
        'question': 'Какой символ или слово из представленных используется для комментирования кода',
        'options': ['Кхм-кхм', '№', '#', '//'],
        'correct_option': 2
    },
    {
        'question': 'Вам с какой, с правой или с левой?',
        'options': ['С левой пожалуйста', 'Можно с правой?', 'С обеих', 'Затрудняюсь ответить'],
        'correct_option': 2
    },
]